app/views/jobs/edit.html.erb

  <%= f.label :mechanic_id %>
  <%= f.collection_select :mechanic_id, Mechanic.all, :id, :name, {selected: @mechanic.id} %><br><br>
---
SELECT "mechanics".* FROM "mechanics"

  <%= f.label :customer_id %>
  <%= f.collection_select :customer_id, Customer.all, :id, :name %><br><br>
---
SELECT "customers".* FROM "customers"