app/views/jobs/show.html.erb

SELECT "work_orders".* FROM "work_orders" WHERE "work_orders"."job_id" = ?  [["job_id", 7]]
---
<ul>
  <% @job.work_orders.each do |order| %>