app/views/static/home.html.erb

        <ul>
          <% job.work_orders.each do |order| %>
---
SELECT "work_orders".* FROM "work_orders" WHERE "work_orders"."job_id" = ?  [["job_id", 10]]