app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)
    if @customer.save
---
INSERT INTO "customers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Guillermo"], ["created_at", "2016-02-20 23:04:05.557523"], ["updated_at", "2016-02-20 23:04:05.557523"]]

  def update
    @customer = Customer.find(params[:id])
    @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "customers" SET "name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "Rosco!"], ["updated_at", "2016-02-23 03:06:50.493320"], ["id", 1]]