app/controllers/jobs_controller.rb

SELECT "mechanics".* FROM "mechanics"
SELECT "customers".* FROM "customers"
---
  def new
    @mechanics = Mechanic.all
    @customers = Customer.all

SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ?  ORDER BY "mechanics"."id" ASC LIMIT 1  [["id", 1]]
SELECT "mechanics".* FROM "mechanics"
SELECT "customers".* FROM "customers"
---
  def create
    @job = Job.new(job_params)
    if @job.save
      @mechanic = Mechanic.find_by(id: params[:job][:mechanic_id])
      redirect_to mechanic_job_path(@mechanic.id, @job.id)
    else
      @mechanic = Mechanic.find_by(id: params[:job][:mechanic_id])
      @mechanics = Mechanic.all
      @customers = Customer.all

SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ?  ORDER BY "mechanics"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_mechanic
      @mechanic = Mechanic.find_by(id: params[:mechanic_id])