app/controllers/mechanics_controller.rb

SELECT  "mechanics".* FROM "mechanics"  ORDER BY "mechanics"."id" ASC LIMIT 1
---
  def index
    @mechanics = Mechanic.all

SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."id" = ?  ORDER BY "mechanics"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    @mechanic = Mechanic.find(params[:id])