app/controllers/sessions_controller.rb

  def create
    mechanic = Mechanic.find_or_create_by(uid: auth['uid']) do |u|
---
INSERT INTO "mechanics" ("uid", "name", "email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "mechanics".* FROM "mechanics" WHERE "mechanics"."uid" = ? LIMIT 1  [["uid", 10103299793763668]]