app/controllers/work_orders_controller.rb

  def complete
    params[:ids].each do |id|
      order = WorkOrder.find_by(id: id)
      order.update(status: 1)
---
SELECT  "work_orders".* FROM "work_orders" WHERE "work_orders"."id" = ? LIMIT 1  [["id", 26]]
UPDATE "work_orders" SET "status" = ?, "updated_at" = ? WHERE "work_orders"."id" = ?  [["status", 1], ["updated_at", "2016-02-24 02:14:03.422771"], ["id", 26]]